rails/app/controllers/screen_data_controller.rb

  def create
    sketch = get_sketch
    unless sketch
      render :text => "", :status => 404
      return
    end
    sketch.screen_data = params[:d]
    if sketch.save
---
UPDATE "sketches" SET "screen_data" = '876', "updated_at" = '2010-06-15 16:41:25.193487' WHERE "id" = 1