rails/app/controllers/sketches_controller.rb

  def index
    @sketches = Sketch.all
---
SELECT * FROM "sketches"

  def new
    @district = if params[:district_id]
      District.find(params[:district_id])
---
SELECT * FROM "districts" WHERE ("districts"."id" = 2)

  def create
    user = current_user
    user.name = params[:user_name]
    user.save!
    @sketch = Sketch.create!(params[:sketch])
---
UPDATE "users" SET "updated_at" = '2010-06-14 21:31:20', "name" = 'anonymous-A' WHERE "id" = 2
INSERT INTO "sketches" ("created_at", "title", "district_id", "updated_at", "user_id", "map_data", "screen_data") VALUES('2010-06-15 19:10:33.561637', 'Draw Me a District for a Great Good', NULL, '2010-06-15 19:10:33.561637', NULL, NULL, NULL) RETURNING "id"

  def show
    @sketch = Sketch.find(params[:id])
---
SELECT * FROM "sketches" WHERE ("sketches"."id" = 6)